In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import datetime as dt
%matplotlib inline

In [2]:
prices = pd.DataFrame()

tickers = ['HSBA.UK', 'BARC.UK', 'LLOY.UK', 'RBS.UK', 'BP.UK', 'RIO.UK', 'AAL.UK']

df_list = []

for ticker in tickers:
    df = pd.read_csv(ticker + '.csv')
    df.Date = pd.to_datetime(df.Date)
    df = df.set_index('Date')
    df_list.append(df)

In [3]:
RDSA = pd.read_csv('RDSA.UK.csv', sep = ';')

RDSA.Close = RDSA.Close.apply(lambda x: x.replace(',','.'))
RDSA.Close = RDSA.Close.astype('float64')
RDSA.Date = pd.to_datetime(RDSA.Date, format='%d/%m/%Y')

RDSA = RDSA.set_index('Date')

df_list.append(RDSA)
tickers.append('RDSA.UK')

In [4]:
prices = pd.concat(df_list, axis=1, join='outer')
prices.columns = tickers
prices = prices.sort_index()

In [5]:
prices.head()

,HSBA.UK,BARC.UK,LLOY.UK,RBS.UK,BP.UK,RIO.UK,AAL.UK,RDSA.UK
Date,,,,,,,,
2009-01-07,427.80,144.11,73.682,486.03,409.64,1148.67,1521.30,18.05
2009-01-08,425.98,150.20,76.360,501.90,416.09,1096.69,1431.35,18.41
2009-01-09,418.16,151.91,78.201,526.70,405.93,1033.30,1314.05,17.88
2009-01-12,424.96,156.68,83.674,545.54,398.11,1018.74,1279.65,17.73
2009-01-13,425.79,140.79,79.094,506.86,403.18,985.76,1260.24,18.02

In [6]:
prices.index

DatetimeIndex(['2009-01-07', '2009-01-08', '2009-01-09', '2009-01-12',
               '2009-01-13', '2009-01-14', '2009-01-15', '2009-01-16',
               '2009-01-19', '2009-01-20',
               ...
               '2011-12-21', '2011-12-22', '2011-12-23', '2011-12-28',
               '2011-12-29', '2011-12-30', '2012-01-03', '2012-01-04',
               '2012-01-05', '2012-01-06'],
              dtype='datetime64[ns]', name='Date', length=758, freq=None)

In [7]:
prices.dtypes

HSBA.UK    float64
BARC.UK    float64
LLOY.UK    float64
RBS.UK     float64
BP.UK      float64
RIO.UK     float64
AAL.UK     float64
RDSA.UK    float64
dtype: object

Датафрейм собран, все в нужном формате. Идем дальше.

## Пропуски

In [8]:
prices.isna().sum()

HSBA.UK    8
BARC.UK    1
LLOY.UK    1
RBS.UK     0
BP.UK      9
RIO.UK     5
AAL.UK     0
RDSA.UK    0
dtype: int64

Заменим пропуски интерполяцией.

In [9]:
prices = prices.interpolate(method = 'time', axis = 0)

In [10]:
prices.isna().sum()

HSBA.UK    0
BARC.UK    0
LLOY.UK    0
RBS.UK     0
BP.UK      0
RIO.UK     0
AAL.UK     0
RDSA.UK    0
dtype: int64

Поставим колонки по секторам. Сначала - банковский, затем - нефтегаз, в конце - металлургия.

In [11]:
new_order = ['HSBA.UK', 'BARC.UK', 'LLOY.UK', 'RBS.UK', 'BP.UK', 'RDSA.UK', 'RIO.UK', 'AAL.UK']

prices = prices[new_order]
prices.head()

,HSBA.UK,BARC.UK,LLOY.UK,RBS.UK,BP.UK,RDSA.UK,RIO.UK,AAL.UK
Date,,,,,,,,
2009-01-07,427.80,144.11,73.682,486.03,409.64,18.05,1148.67,1521.30
2009-01-08,425.98,150.20,76.360,501.90,416.09,18.41,1096.69,1431.35
2009-01-09,418.16,151.91,78.201,526.70,405.93,17.88,1033.30,1314.05
2009-01-12,424.96,156.68,83.674,545.54,398.11,17.73,1018.74,1279.65
2009-01-13,425.79,140.79,79.094,506.86,403.18,18.02,985.76,1260.24

In [42]:
prices.to_csv('stock_prices.csv')

## Получим доходности

Получим однодневные.

In [3]:
prices = pd.read_csv('stock_prices.csv', parse_dates=True, index_col='Date')

In [6]:
day1_returns = prices.pct_change()

In [7]:
day1_returns.head()

,AAL.L,BARC.L,BP.L,HSBA.L,LLOY.L,RBS.L,RDSA.L,RIO.L
Date,,,,,,,,
2009-07-01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2009-07-02,-0.058117,-0.004308,-0.018469,-0.018057,-0.034436,-0.038193,-0.032797,-0.056997
2009-07-03,-0.007242,0.027682,-0.003535,0.017390,0.024270,0.023351,-0.006649,-0.004423
2009-07-06,-0.049606,-0.014310,-0.026187,-0.005010,-0.020736,-0.028619,-0.020750,-0.069595
2009-07-07,-0.000614,0.011101,0.002357,-0.007404,-0.001499,-0.009555,-0.004101,0.018568

In [8]:
day1_returns = day1_returns[1:]

In [9]:
day1_returns.head()

,AAL.L,BARC.L,BP.L,HSBA.L,LLOY.L,RBS.L,RDSA.L,RIO.L
Date,,,,,,,,
2009-07-02,-0.058117,-0.004308,-0.018469,-0.018057,-0.034436,-0.038193,-0.032797,-0.056997
2009-07-03,-0.007242,0.027682,-0.003535,0.017390,0.024270,0.023351,-0.006649,-0.004423
2009-07-06,-0.049606,-0.014310,-0.026187,-0.005010,-0.020736,-0.028619,-0.020750,-0.069595
2009-07-07,-0.000614,0.011101,0.002357,-0.007404,-0.001499,-0.009555,-0.004101,0.018568
2009-07-08,-0.039324,-0.030403,-0.005985,-0.019296,-0.034700,-0.044620,-0.008236,-0.012760

In [10]:
day1_returns.to_csv('1_day_returns.csv')

Получим 10-дневные.

In [19]:
prices.head()

,HSBA.UK,BARC.UK,LLOY.UK,RBS.UK,BP.UK,RDSA.UK,RIO.UK,AAL.UK
Date,,,,,,,,
2009-01-07,427.80,144.11,73.682,486.03,409.64,18.05,1148.67,1521.30
2009-01-08,425.98,150.20,76.360,501.90,416.09,18.41,1096.69,1431.35
2009-01-09,418.16,151.91,78.201,526.70,405.93,17.88,1033.30,1314.05
2009-01-12,424.96,156.68,83.674,545.54,398.11,17.73,1018.74,1279.65
2009-01-13,425.79,140.79,79.094,506.86,403.18,18.02,985.76,1260.24

In [24]:
day10_returns = prices.pct_change(periods=9)

In [25]:
day10_returns[:20]

,HSBA.UK,BARC.UK,LLOY.UK,RBS.UK,BP.UK,RDSA.UK,RIO.UK,AAL.UK
Date,,,,,,,,
2009-01-07,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2009-01-08,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2009-01-09,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2009-01-12,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2009-01-13,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2009-01-14,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2009-01-15,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2009-01-16,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2009-01-19,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2009-01-20,-0.245792,-0.570689,-0.638392,-0.789787,-0.049165,-0.039889,-0.185980,-0.242904
2009-01-21,-0.194892,-0.626511,-0.648756,-0.752959,-0.086976,-0.089082,-0.127155,-0.189779
2009-01-22,-0.161517,-0.669258,-0.626603,-0.770249,-0.056389,-0.062640,-0.057660,-0.148328
2009-01-23,-0.192959,-0.722670,-0.649604,-0.779998,-0.042250,-0.033841,-0.052290,-0.124745
2009-01-26,-0.154677,-0.465324,-0.509773,-0.716253,-0.014559,-0.006659,0.064955,-0.046174
2009-01-27,-0.097700,-0.366683,-0.427504,-0.623495,0.040915,0.038596,0.187709,0.040989
2009-01-28,0.064875,-0.179480,-0.025118,-0.466180,0.040276,0.064110,0.152735,0.113729
2009-01-29,0.024745,0.023482,-0.095542,-0.394811,0.014241,0.062537,0.028524,-0.023348
2009-01-30,0.084333,0.205669,0.395395,0.896576,0.011295,0.011696,0.011431,-0.050983
2009-02-02,0.086688,0.301788,0.968698,0.980523,-0.026624,0.001731,0.088820,-0.050531
2009-02-03,0.022801,0.396360,0.966705,0.647955,0.003132,0.045319,0.109262,-0.024334

In [28]:
day10_returns = day10_returns[9:]

In [29]:
day10_returns.head()

,HSBA.UK,BARC.UK,LLOY.UK,RBS.UK,BP.UK,RDSA.UK,RIO.UK,AAL.UK
Date,,,,,,,,
2009-01-20,-0.245792,-0.570689,-0.638392,-0.789787,-0.049165,-0.039889,-0.185980,-0.242904
2009-01-21,-0.194892,-0.626511,-0.648756,-0.752959,-0.086976,-0.089082,-0.127155,-0.189779
2009-01-22,-0.161517,-0.669258,-0.626603,-0.770249,-0.056389,-0.062640,-0.057660,-0.148328
2009-01-23,-0.192959,-0.722670,-0.649604,-0.779998,-0.042250,-0.033841,-0.052290,-0.124745
2009-01-26,-0.154677,-0.465324,-0.509773,-0.716253,-0.014559,-0.006659,0.064955,-0.046174

In [30]:
day10_returns.to_csv('10_days_returns.csv')

Получим 10-дневные.

## Логарифмические доходности

In [17]:
log_returns = np.log(prices/prices.shift(1))

In [18]:
log_returns.head()

,HSBA.UK,BARC.UK,LLOY.UK,RBS.UK,BP.UK,RDSA.UK,RIO.UK,AAL.UK
Date,,,,,,,,
2009-01-07,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2009-01-08,-0.004263,0.041391,0.035700,0.032131,0.015623,0.019748,-0.046308,-0.060947
2009-01-09,-0.018528,0.011321,0.023823,0.048230,-0.024721,-0.029211,-0.059539,-0.085504
2009-01-12,0.016131,0.030917,0.067646,0.035145,-0.019452,-0.008425,-0.014191,-0.026527
2009-01-13,0.001951,-0.106936,-0.056291,-0.073541,0.012655,0.016224,-0.032909,-0.015284

In [19]:
log_returns = log_returns[1:]

In [20]:
log_returns.to_csv('log_returns.csv')

In [8]:
log_10_day_returns = np.log(prices/prices.shift(9))

In [10]:
log_10_day_returns = log_10_day_returns[9:]

In [11]:
log_10_day_returns.to_csv('log_10_day_returns.csv')